In [35]:
import numpy as np
import pandas as pd

## Series

In [36]:
benimSozluk={"Dilber":21,"Songül":19,"Aleyna":15}

In [37]:
pd.Series(benimSozluk)

Dilber    21
Songül    19
Aleyna    15
dtype: int64

In [38]:
benimYas=[50,40,30]
benimİsim=["Dilber","Songül","Aleyna"]

In [39]:
pd.Series(benimYas)

0    50
1    40
2    30
dtype: int64

In [40]:
pd.Series(data=benimYas,index=benimİsim)

Dilber    50
Songül    40
Aleyna    30
dtype: int64

In [41]:
numpyDizi=np.array([10,20,30])

In [42]:
pd.Series(numpyDizi)

0    10
1    20
2    30
dtype: int32

In [43]:
pd.Series(["dilber","songül","aleyna"],[1,2,3])

1    dilber
2    songül
3    aleyna
dtype: object

In [44]:
yarisma=pd.Series([10,5,1],["dilber","songül","aleyna"])

In [45]:
yarisma

dilber    10
songül     5
aleyna     1
dtype: int64

In [46]:
yarisma2=pd.Series([20,8,5],["dilber","songül","aleyna"])

In [47]:
yarisma2

dilber    20
songül     8
aleyna     5
dtype: int64

In [48]:
yarisma2["songül"]

8

In [49]:
sonSonuc=yarisma+yarisma2

In [50]:
sonSonuc

dilber    30
songül    13
aleyna     6
dtype: int64

In [51]:
farkliSeries=pd.Series([20,30,40,50],["a","b","c","d"])

In [52]:
farkliSeries2=pd.Series([10,5,3,1],["a","c","f","g"])

In [53]:
farkliSeries+farkliSeries2

a    30.0
b     NaN
c    45.0
d     NaN
f     NaN
g     NaN
dtype: float64

## DATA FRAME

In [54]:
data = np.random.randn(4,3)

In [55]:
data

array([[ 1.63697726, -0.21443207,  0.47704653],
       [-1.10185546, -0.27777157,  1.55308155],
       [ 1.66696877, -0.58332147, -0.63902591],
       [-0.95024737, -1.25730277, -2.00412642]])

In [56]:
dataFrame=pd.DataFrame(data)

In [57]:
dataFrame[0]

0    1.636977
1   -1.101855
2    1.666969
3   -0.950247
Name: 0, dtype: float64

In [58]:
yeniDataFrame=pd.DataFrame(data,index=["Atil","Zeynep","Dilber","Songül"],columns=["maas","yas","calisma saati"])

In [59]:
yeniDataFrame

            maas       yas  calisma saati
Atil    1.636977 -0.214432       0.477047
Zeynep -1.101855 -0.277772       1.553082
Dilber  1.666969 -0.583321      -0.639026
Songül -0.950247 -1.257303      -2.004126

In [60]:
yeniDataFrame["yas"]

Atil     -0.214432
Zeynep   -0.277772
Dilber   -0.583321
Songül   -1.257303
Name: yas, dtype: float64

In [61]:
yeniDataFrame["calisma saati"]

Atil      0.477047
Zeynep    1.553082
Dilber   -0.639026
Songül   -2.004126
Name: calisma saati, dtype: float64

In [62]:
yeniDataFrame[["maas","yas"]]

            maas       yas
Atil    1.636977 -0.214432
Zeynep -1.101855 -0.277772
Dilber  1.666969 -0.583321
Songül -0.950247 -1.257303

In [63]:
yeniDataFrame.loc["Dilber"]

maas             1.666969
yas             -0.583321
calisma saati   -0.639026
Name: Dilber, dtype: float64

In [64]:
yeniDataFrame.iloc[1]

maas            -1.101855
yas             -0.277772
calisma saati    1.553082
Name: Zeynep, dtype: float64

In [68]:
yeniDataFrame["maas"]

Atil      1.636977
Zeynep   -1.101855
Dilber    1.666969
Songül   -0.950247
Name: maas, dtype: float64

In [69]:
yeniDataFrame["emeklilik yasi"]=yeniDataFrame["yas"]+yeniDataFrame["yas"]

In [70]:
yeniDataFrame

            maas       yas  calisma saati  emeklilik yasi
Atil    1.636977 -0.214432       0.477047       -0.428864
Zeynep -1.101855 -0.277772       1.553082       -0.555543
Dilber  1.666969 -0.583321      -0.639026       -1.166643
Songül -0.950247 -1.257303      -2.004126       -2.514606

In [71]:
yeniDataFrame.drop("emeklilik yasi",axis=1)

            maas       yas  calisma saati
Atil    1.636977 -0.214432       0.477047
Zeynep -1.101855 -0.277772       1.553082
Dilber  1.666969 -0.583321      -0.639026
Songül -0.950247 -1.257303      -2.004126

In [72]:
yeniDataFrame.drop("Dilber")

            maas       yas  calisma saati  emeklilik yasi
Atil    1.636977 -0.214432       0.477047       -0.428864
Zeynep -1.101855 -0.277772       1.553082       -0.555543
Songül -0.950247 -1.257303      -2.004126       -2.514606

In [73]:
yeniDataFrame

            maas       yas  calisma saati  emeklilik yasi
Atil    1.636977 -0.214432       0.477047       -0.428864
Zeynep -1.101855 -0.277772       1.553082       -0.555543
Dilber  1.666969 -0.583321      -0.639026       -1.166643
Songül -0.950247 -1.257303      -2.004126       -2.514606

In [74]:
yeniDataFrame.drop("emeklilik yasi",axis=1,inplace=True)

In [75]:
yeniDataFrame

            maas       yas  calisma saati
Atil    1.636977 -0.214432       0.477047
Zeynep -1.101855 -0.277772       1.553082
Dilber  1.666969 -0.583321      -0.639026
Songül -0.950247 -1.257303      -2.004126

In [76]:
yeniDataFrame.loc["Zeynep"]["yas"]

-0.2777715746456876

In [77]:
yeniDataFrame.loc["Zeynep","yas"]

-0.2777715746456876

In [78]:
yeniDataFrame

            maas       yas  calisma saati
Atil    1.636977 -0.214432       0.477047
Zeynep -1.101855 -0.277772       1.553082
Dilber  1.666969 -0.583321      -0.639026
Songül -0.950247 -1.257303      -2.004126

In [80]:
yeniDataFrame[yeniDataFrame<0]

            maas       yas  calisma saati
Atil         NaN -0.214432            NaN
Zeynep -1.101855 -0.277772            NaN
Dilber       NaN -0.583321      -0.639026
Songül -0.950247 -1.257303      -2.004126

In [85]:
yeniDataFrame[yeniDataFrame["calisma saati"] > 0]

            maas       yas  calisma saati
Atil    1.636977 -0.214432       0.477047
Zeynep -1.101855 -0.277772       1.553082

In [89]:
yeniDataFrame.reset_index()

    index      maas       yas  calisma saati
0    Atil  1.636977 -0.214432       0.477047
1  Zeynep -1.101855 -0.277772       1.553082
2  Dilber  1.666969 -0.583321      -0.639026
3  Songül -0.950247 -1.257303      -2.004126

In [87]:
yeniDataFrame

            maas       yas  calisma saati
Atil    1.636977 -0.214432       0.477047
Zeynep -1.101855 -0.277772       1.553082
Dilber  1.666969 -0.583321      -0.639026
Songül -0.950247 -1.257303      -2.004126

In [90]:
yeniIndexListesi=["Ati","Zey","Dil","Son"]

In [91]:
yeniDataFrame["yeni Indeks"]=yeniIndexListesi

In [92]:
yeniDataFrame

            maas       yas  calisma saati yeni Indeks
Atil    1.636977 -0.214432       0.477047         Ati
Zeynep -1.101855 -0.277772       1.553082         Zey
Dilber  1.666969 -0.583321      -0.639026         Dil
Songül -0.950247 -1.257303      -2.004126         Son

In [95]:
yeniDataFrame.set_index("yeni Indeks",inplace=True)

In [96]:
yeniDataFrame

                 maas       yas  calisma saati
yeni Indeks
Ati          1.636977 -0.214432       0.477047
Zey         -1.101855 -0.277772       1.553082
Dil          1.666969 -0.583321      -0.639026
Son         -0.950247 -1.257303      -2.004126

In [97]:
ilkIndexler=["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [98]:
icIndexler=["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [101]:
birlesmisIndex=list(zip(ilkIndexler,icIndexler))

In [103]:
birlesmisIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [105]:
birlesmisIndex=pd.MultiIndex.from_tuples(birlesmisIndex)

In [106]:
birlesmisIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [107]:
benimCizgiFilmListem=[[40,"a"],[10,"h"],[26,"k"],[45,"k"],[78,"d"],[69,"l"]]

In [108]:
numpyDizim=np.array(benimCizgiFilmListem)

In [110]:
cizgiFilmDataFrame=pd.DataFrame(numpyDizim,index=birlesmisIndex,columns=["yas","meslek"])

In [111]:
cizgiFilmDataFrame

                   yas meslek
Simpson    Homer    40      a
           Bart     10      h
           Marge    26      k
South Park Cartman  45      k
           Kenny    78      d
           Kyle     69      l

In [113]:
cizgiFilmDataFrame.loc["Simpson"]

      yas meslek
Homer  40      a
Bart   10      h
Marge  26      k

In [114]:
cizgiFilmDataFrame.loc["Simpson"].loc["Bart"]

yas       10
meslek     h
Name: Bart, dtype: object

In [117]:
cizgiFilmDataFrame.index.names=["Film Adı","İsim"]

In [118]:
cizgiFilmDataFrame

                   yas meslek
Film Adı   İsim
Simpson    Homer    40      a
           Bart     10      h
           Marge    26      k
South Park Cartman  45      k
           Kenny    78      d
           Kyle     69      l

In [119]:
sozluk={"İstanbul":[30,29,np.nan],"Ankara":[38,np.nan,28],"İzmir":[40,29,30]}
havaDataFrame=pd.DataFrame(sozluk,index=["Pazartesi","Salı","Çarşamba"])

In [120]:
havaDataFrame

           İstanbul  Ankara  İzmir
Pazartesi      30.0    38.0     40
Salı           29.0     NaN     29
Çarşamba        NaN    28.0     30

In [121]:
havaDataFrame.dropna()

           İstanbul  Ankara  İzmir
Pazartesi      30.0    38.0     40

In [122]:
havaDataFrame

           İstanbul  Ankara  İzmir
Pazartesi      30.0    38.0     40
Salı           29.0     NaN     29
Çarşamba        NaN    28.0     30

In [123]:
havaDataFrame.dropna(axis=1)

           İzmir
Pazartesi     40
Salı          29
Çarşamba      30

In [124]:
ysozluk={"İstanbul":[30,29,np.nan],"Ankara":[38,np.nan,28],"İzmir":[40,29,30],"Antalya":[45,np.nan,np.nan]}
yhavaDataFrame=pd.DataFrame(ysozluk,index=["Pazartesi","Salı","Çarşamba"])

In [125]:
yhavaDataFrame

           İstanbul  Ankara  İzmir  Antalya
Pazartesi      30.0    38.0     40     45.0
Salı           29.0     NaN     29      NaN
Çarşamba        NaN    28.0     30      NaN

In [126]:
yhavaDataFrame.dropna(axis=1,thresh=2)

           İstanbul  Ankara  İzmir
Pazartesi      30.0    38.0     40
Salı           29.0     NaN     29
Çarşamba        NaN    28.0     30

In [127]:
yhavaDataFrame.fillna(20)

           İstanbul  Ankara  İzmir  Antalya
Pazartesi      30.0    38.0     40     45.0
Salı           29.0    20.0     29     20.0
Çarşamba       20.0    28.0     30     20.0

## Groupby

In [140]:
sozlukMaas={"Departmanlar":["Yazılım","Satış","Yazılım","Finans","Pazarlama","Satış"],
           "Çalışan İsmi":["Dilber","Songul","Aleyna","Fatma","Ayşe","Hasan"],
           "Maaş":[1000,2000,3000,4000,5000,6000]
           }

In [141]:
maasDataFrame=pd.DataFrame(sozlukMaas)

In [142]:
maasDataFrame

  Departmanlar Çalışan İsmi  Maaş
0      Yazılım       Dilber  1000
1        Satış       Songul  2000
2      Yazılım       Aleyna  3000
3       Finans        Fatma  4000
4    Pazarlama         Ayşe  5000
5        Satış        Hasan  6000

In [145]:
grupObjesi=maasDataFrame.groupby("Departmanlar")

In [146]:
grupObjesi.count()

              Çalışan İsmi  Maaş
Departmanlar
Finans                   1     1
Pazarlama                1     1
Satış                    2     2
Yazılım                  2     2

In [147]:
grupObjesi.mean()

              Maaş
Departmanlar
Finans        4000
Pazarlama     5000
Satış         4000
Yazılım       2000

## Concat

In [155]:
sozluk1={"isim":["Dilber","Songul","Aleyna"],
         "spor":["koşu","yüzme","futbol"],
        "kalori":[100,200,300]
        }

In [156]:
dataF1=pd.DataFrame(sozluk1)

In [157]:
sozluk2={"isim":["Dilara","Gulbahar","Alya","levent"],
         "spor":["badminton","yüzme","futbol","koşu"],
        "kalori":[150,200,200,300]
        }

In [158]:
dataF2=pd.DataFrame(sozluk2,index=[3,4,5,6])

In [159]:
sozluk3={"isim":["Fatma","Bahar","Kiraz","Haydar"],
         "spor":["koşu","basketbol","futbol","koşu"],
        "kalori":[350,250,100,350]
        }

In [160]:
dataF3=pd.DataFrame(sozluk3,index=[7,8,9,10])

In [161]:
pd.concat([dataF1,dataF2,dataF3])

        isim       spor  kalori
0     Dilber       koşu     100
1     Songul      yüzme     200
2     Aleyna     futbol     300
3     Dilara  badminton     150
4   Gulbahar      yüzme     200
5       Alya     futbol     200
6     levent       koşu     300
7      Fatma       koşu     350
8      Bahar  basketbol     250
9      Kiraz     futbol     100
10    Haydar       koşu     350

# Merge

In [167]:
mergeS1={"isim":["Dilara","Gulbahar","Alya","levent"],
         "spor":["badminton","yüzme","futbol","koşu"]
        }

In [168]:
mergeD1=pd.DataFrame(mergeS1)

In [169]:
mergeS2={"isim":["Dilara","Gulbahar","Alya","levent"],
        "kalori":[150,200,200,300]
        }

In [170]:
mergeD2=pd.DataFrame(mergeS2)

In [171]:
pd.merge(mergeD1,mergeD2,on="isim")

       isim       spor  kalori
0    Dilara  badminton     150
1  Gulbahar      yüzme     200
2      Alya     futbol     200
3    levent       koşu     300

In [172]:
maasS={"isim":["Dilara","Gulbahar","Alya","levent"],
        "Departmanlar":["Yazılım","Satış","Pazarlama","Yazılım"],
       "Maas":[500,600,400,300]
        }

In [173]:
maasD=pd.DataFrame(maasS)

In [174]:
maasD

       isim Departmanlar  Maas
0    Dilara      Yazılım   500
1  Gulbahar        Satış   600
2      Alya    Pazarlama   400
3    levent      Yazılım   300

In [175]:
maasD["Departmanlar"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [176]:
maasD["Departmanlar"].nunique()

3

In [183]:
maasD["Departmanlar"].value_counts()

Yazılım      2
Pazarlama    1
Satış        1
Name: Departmanlar, dtype: int64

In [184]:
def brut(maas):
    return maas*2